package baekjoon;

import java.util.*;
import java.io.*;

public class 오토에버문제_2 {
	public static void main(String[] args) throws IOException {
		
		// ssafy 전형으로 본거 23/6/17
		
		// 문제1.
		// 체스문제
		// 킹,퀸 등 말 6개 있고 갈수있는곳은 '.'->'*' 로 바꿔서 출력
		
		
		// 문제2.
		// 번호 섞기 문제?
		// N개의 원소
		// (0~N)부터 출발 ~ N개씩 끊어서 볼떄 중복되는 번호가 있는지 확인.
		// 있으면 N 없으면 Y
		// (테스트케이스)
		// 4 9 (N M)
		// 1 2 3 4 4 3 2 1 2 이런식
		
		// 문제3.
		// 그래프문제, 학연 아닌 두그룹으로 나눌수 있는지 여부파악
		// union find 써서하는거 같은데
		// M 인원, N 간선 갯수 주어지고, 양방향 간선임
		// 두 그룹으로 나눌 수 있으면 1, 아니면 0
		// (테스트케이스)
		// 10 10
		// 1 9
		// 2 8
		// 1 10
		// 3 4 ...
		
	}
}
